---
kind: method
id: M:Autodesk.Revit.UI.RevisionsOnSheetUIServiceData.GetRevitElementIds
source: html/24c353ed-b4bc-1ee9-d64d-4624fcfc0e95.htm
---
# Autodesk.Revit.UI.RevisionsOnSheetUIServiceData.GetRevitElementIds Method

return the list of revit Element Ids

## Syntax (C#)
```csharp
public IList<ElementId> GetRevitElementIds()
```